uhnp/src/DataProcessors/РазнесениеВыписки/РазнесениеВыписки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РазнесениеВыписки</name>
  <attributes>
    <name>ПериодОтбора</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпоновщикНастроек</name>
    <type>
      <types>DataCompositionSettingsComposer</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСхемыКомпоновкиДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

uhnp/src/InformationRegisters/ШаблоныАналитикПлатежей/ШаблоныАналитикПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШаблоныАналитикПлатежей</name>
  <resources>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.Договор</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </resources>
  <resources>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаБДДС1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаБДДС2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаБДДС3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаБДДС4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаБДДС5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаБДДС6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетОрганизации</name>
    <type>
      <types>DefinedType.БанковскийСчетОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>210</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ВидыДвиженийПриходРасход/ВидыДвиженийПриходРасход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженийПриходРасход</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ДоговорыАренды/ДоговорыАренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыАренды</name>
  <basedOn>Catalog.Партнеры</basedOn>
  <attributes>
    <name>ТипДоговора</name>
    <type>
      <types>EnumRef.ТипыДоговоровАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерДоговора</name>
    <type>
      <types>EnumRef.ХарактерыДоговоровФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Балансодержатель</name>
    <type>
      <types>EnumRef.БалансодержательПредметовАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПредметыАрендыВРеглУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПредметыАрендыВУпрУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОбеспечительныйПлатеж</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВыкупПредметовАренды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьАвансированиеВыкупнойСтоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОпределенияСтоимостиАктивов</name>
    <type>
      <types>EnumRef.СпособыОпределенияСтоимостиПредметовАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовУслуги</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовУслуги</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеУслуги</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовПроценты</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговораУХ</name>
    <comment>Вид договора по классификатору &quot;1С:Управление Холдингом&quot;</comment>
    <type>
      <types>CatalogRef.ВидыДоговоровКонтрагентовУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыУчетаФИ</name>
    <type>
      <types>CatalogRef.ПараметрыУчетаФинансовыхИнструментовМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидФинансовогоИнструмента</name>
    <comment>(УХ)</comment>
    <type>
      <types>EnumRef.ВидыФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>БазовыйДоговор</name>
    <comment>Рамочный договор (УХ)</comment>
    <type>
      <types>CatalogRef.ДоговорыАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСоглашения</name>
    <comment>(УХ)</comment>
    <type>
      <types>EnumRef.ВидыСоглашений</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимАктуализацииЗаявок</name>
    <type>
      <types>EnumRef.РежимыАктуализацииЗаявокПоГрафикам</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовПроценты</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПроценты</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетПлатежа</name>
    <comment>(УХ)</comment>
    <type>
      <types>CatalogRef.ПриоритетыПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>Котировка</name>
    <type>
      <types>CatalogRef.ВидыКотировокФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньИерархииСправедливойСтоимости</name>
    <type>
      <types>EnumRef.УровеньИерархииСправедливойСтоимости</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнойРасчетРезерваПоЗадолженности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассДоговора</name>
    <type>
      <types>CatalogRef.КлассыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>СрочностьЗадолженности</name>
    <type>
      <types>EnumRef.СрочностьЗадолженности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПроект</name>
    <comment>(УХ)</comment>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойЦФО</name>
    <comment>(УХ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяОформлениеЗаявленийОВвозе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_ВидВзаиморасчетов</name>
    <comment>Выполнение задач №000048912</comment>
    <type>
      <types>CatalogRef.тн_ВидыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАгентскогоДоговора</name>
    <type>
      <types>EnumRef.ВидыАгентскихДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетАвансовПоТекущимАренднымПлатежамВРазрезеПлатежныхДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйНомерВалютногоКонтроля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>22</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоходаИностранногоКонтрагента</name>
    <type>
      <types>EnumRef.ВидыДоходовИностранныхОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеГрафикаРасчетовБДДС</name>
    <type>
      <types>EnumRef.РежимыИспользованияГрафика</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроизводственныеКалендари</name>
    <attributes>
      <name>ПроизводственныйКалендарь</name>
      <type>
        <types>CatalogRef.ПроизводственныеКалендари</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/DataProcessors/РазнесениеВыписки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПоШаблонамАналитик(Параметры,АдресХранилища) Экспорт
	
	ДеревоДокументов = Параметры.ДеревоДокументов;
	
	ТаблицаИсходныхДанных = СформироватьТаблицуИсходныхДанных(ДеревоДокументов);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка КАК Ссылка,
	|	ДанныеДокументов.Организация КАК Организация,
	|	ДанныеДокументов.Контрагент КАК Контрагент,
	|	ДанныеДокументов.СчетОрганизации КАК СчетОрганизации,
	|	ДанныеДокументов.НазначениеПлатежа КАК НазначениеПлатежа
	|ПОМЕСТИТЬ ВТ_ДанныеДокументов
	|ИЗ
	|	&ДанныеДокументов КАК ДанныеДокументов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДокументов.Ссылка КАК Ссылка,
	|	ШаблоныАналитикПлатежей.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ШаблоныАналитикПлатежей.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	4 - ВЫБОР
	|		КОГДА ШаблоныАналитикПлатежей.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ШаблоныАналитикПлатежей.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ШаблоныАналитикПлатежей.СчетОрганизации = &ПустойБанковскийСчет
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ШаблоныАналитикПлатежей.НазначениеПлатежа = """"
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РейтингШаблона,
	|	ШаблоныАналитикПлатежей.ЦФО КАК ЦФО,
	|	ШаблоныАналитикПлатежей.Проект КАК Проект,
	|	ШаблоныАналитикПлатежей.АналитикаБДДС1 КАК АналитикаБДДС1,
	|	ШаблоныАналитикПлатежей.АналитикаБДДС2 КАК АналитикаБДДС2,
	|	ШаблоныАналитикПлатежей.АналитикаБДДС3 КАК АналитикаБДДС3,
	|	ШаблоныАналитикПлатежей.АналитикаБДДС4 КАК АналитикаБДДС4,
	|	ШаблоныАналитикПлатежей.АналитикаБДДС5 КАК АналитикаБДДС5,
	|	ШаблоныАналитикПлатежей.АналитикаБДДС6 КАК АналитикаБДДС6,
	|	ШаблоныАналитикПлатежей.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ПОМЕСТИТЬ ВТ_ДанныеШаблоновНесгруппированные
	|ИЗ
	|	РегистрСведений.ШаблоныАналитикПлатежей КАК ШаблоныАналитикПлатежей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеДокументов КАК ВТ_ДанныеДокументов
	|		ПО (ВТ_ДанныеДокументов.Организация = ШаблоныАналитикПлатежей.Организация
	|				ИЛИ ШаблоныАналитикПлатежей.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|			И (ВТ_ДанныеДокументов.Контрагент = ШаблоныАналитикПлатежей.Контрагент
	|				ИЛИ ШаблоныАналитикПлатежей.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|			И (ВТ_ДанныеДокументов.СчетОрганизации = ШаблоныАналитикПлатежей.СчетОрганизации
	|				ИЛИ ШаблоныАналитикПлатежей.СчетОрганизации = &ПустойБанковскийСчет)
	|			И (ВТ_ДанныеДокументов.НазначениеПлатежа ПОДОБНО ШаблоныАналитикПлатежей.НазначениеПлатежа СПЕЦСИМВОЛ ""\""
	|				ИЛИ ШаблоныАналитикПлатежей.НазначениеПлатежа = """")
	|			И (ВЫБОР
	|				КОГДА ШаблоныАналитикПлатежей.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)
	|					ТОГДА ВТ_ДанныеДокументов.Ссылка ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств
	|				КОГДА ШаблоныАналитикПлатежей.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
	|					ТОГДА ВТ_ДанныеДокументов.Ссылка ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеШаблоновНесгруппированные.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВТ_ДанныеШаблоновНесгруппированные.РейтингШаблона) КАК РейтингШаблона
	|ПОМЕСТИТЬ ВТ_МаксимальныеВесаШаблонов
	|ИЗ
	|	ВТ_ДанныеШаблоновНесгруппированные КАК ВТ_ДанныеШаблоновНесгруппированные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеШаблоновНесгруппированные.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеШаблоновНесгруппированные.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВТ_ДанныеШаблоновНесгруппированные.ДоговорКонтрагента) КАК ДоговорКонтрагента,
	|	МАКСИМУМ(ВТ_ДанныеШаблоновНесгруппированные.СтатьяДвиженияДенежныхСредств) КАК СтатьяДвиженияДенежныхСредств,
	|	МАКСИМУМ(ВТ_ДанныеШаблоновНесгруппированные.ЦФО) КАК ЦФО,
	|	МАКСИМУМ(ВТ_ДанныеШаблоновНесгруппированные.Проект) КАК Проект,
	|	МАКСИМУМ(ВТ_ДанныеШаблоновНесгруппированные.АналитикаБДДС1) КАК АналитикаБДДС1,
	|	МАКСИМУМ(ВТ_ДанныеШаблоновНесгруппированные.АналитикаБДДС2) КАК АналитикаБДДС2,
	|	МАКСИМУМ(ВТ_ДанныеШаблоновНесгруппированные.АналитикаБДДС3) КАК АналитикаБДДС3,
	|	МАКСИМУМ(ВТ_ДанныеШаблоновНесгруппированные.АналитикаБДДС4) КАК АналитикаБДДС4,
	|	МАКСИМУМ(ВТ_ДанныеШаблоновНесгруппированные.АналитикаБДДС5) КАК АналитикаБДДС5,
	|	МАКСИМУМ(ВТ_ДанныеШаблоновНесгруппированные.АналитикаБДДС6) КАК АналитикаБДДС6,
	|	МАКСИМУМ(ВТ_ДанныеШаблоновНесгруппированные.ХозяйственнаяОперация) КАК ХозяйственнаяОперация
	|ИЗ
	|	ВТ_ДанныеШаблоновНесгруппированные КАК ВТ_ДанныеШаблоновНесгруппированные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксимальныеВесаШаблонов КАК ВТ_МаксимальныеВесаШаблонов
	|		ПО ВТ_ДанныеШаблоновНесгруппированные.Ссылка = ВТ_МаксимальныеВесаШаблонов.Ссылка
	|			И ВТ_ДанныеШаблоновНесгруппированные.РейтингШаблона = ВТ_МаксимальныеВесаШаблонов.РейтингШаблона
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеШаблоновНесгруппированные.Ссылка";

	Запрос.УстановитьПараметр("ДанныеДокументов", ТаблицаИсходныхДанных);
	Запрос.УстановитьПараметр("ПустойБанковскийСчет", 	
		ДенежныеСредстваВстраиваниеУХКлиентСервер.ПолучитьПустойБанковскийСчет());
	
	Выборка = Запрос.Выполнить().Выбрать();
	                                          
	ЗаполнитьДеревоПодобраннымиЗначениями(ДеревоДокументов, Выборка, НСтр("ru = 'По шаблонам аналитик'"));

	ПоместитьВоВременноеХранилище(ДеревоДокументов, АдресХранилища);
	
КонецПроцедуры

Процедура ЗаполнитьПоДаннымДоговоров(Параметры,АдресХранилища) Экспорт
	
	ДеревоДокументов = Параметры.ДеревоДокументов;
	
	ТаблицаИсходныхДанных = СформироватьТаблицуИсходныхДанных(ДеревоДокументов);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка КАК Ссылка,
	|	ДанныеДокументов.Организация КАК Организация,
	|	ДанныеДокументов.Контрагент КАК Контрагент,
	|	ДанныеДокументов.СчетОрганизации КАК СчетОрганизации,
	|	ДанныеДокументов.НазначениеПлатежа КАК НазначениеПлатежа
	|ПОМЕСТИТЬ ВТ_ДанныеДокументов
	|ИЗ
	|	&ДанныеДокументов КАК ДанныеДокументов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДокументов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.Ссылка КАК ДоговорКонтрагента,
	|	ДоговорыКонтрагентов.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ДоговорыКонтрагентов.ОсновнойЦФО КАК ЦФО,
	|	ДоговорыКонтрагентов.ОсновнойПроект КАК Проект,
	|	ДоговорыКонтрагентов.АналитикаБДДС1 КАК АналитикаБДДС1,
	|	ДоговорыКонтрагентов.АналитикаБДДС2 КАК АналитикаБДДС2,
	|	ДоговорыКонтрагентов.АналитикаБДДС3 КАК АналитикаБДДС3,
	|	ДоговорыКонтрагентов.АналитикаБДДС4 КАК АналитикаБДДС4,
	|	ДоговорыКонтрагентов.АналитикаБДДС5 КАК АналитикаБДДС5,
	|	ДоговорыКонтрагентов.АналитикаБДДС6 КАК АналитикаБДДС6
	|ИЗ
	|	ВТ_ДанныеДокументов КАК ВТ_ДанныеДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВТ_ДанныеДокументов.Организация = ДоговорыКонтрагентов.Организация
	|			И ВТ_ДанныеДокументов.Контрагент = ДоговорыКонтрагентов.Контрагент
	|			И (ВТ_ДанныеДокументов.НазначениеПлатежа ПОДОБНО ДоговорыКонтрагентов.Наименование)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДанныеДокументов.Ссылка,
	|	ДоговорыАренды.Ссылка,
	|	ДоговорыАренды.СтатьяДвиженияДенежныхСредств,
	|	ДоговорыАренды.ОсновнойЦФО,
	|	ДоговорыАренды.ОсновнойПроект,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВТ_ДанныеДокументов КАК ВТ_ДанныеДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыАренды КАК ДоговорыАренды
	|		ПО ВТ_ДанныеДокументов.Организация = ДоговорыАренды.Организация
	|			И ВТ_ДанныеДокументов.Контрагент = ДоговорыАренды.Контрагент
	|			И (ВТ_ДанныеДокументов.НазначениеПлатежа ПОДОБНО ДоговорыАренды.Наименование)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДанныеДокументов.Ссылка,
	|	ДоговорыКредитовИДепозитов.Ссылка,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВТ_ДанныеДокументов КАК ВТ_ДанныеДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКредитовИДепозитов КАК ДоговорыКредитовИДепозитов
	|		ПО ВТ_ДанныеДокументов.Организация = ДоговорыКредитовИДепозитов.Организация
	|			И ВТ_ДанныеДокументов.Контрагент = ДоговорыКредитовИДепозитов.Контрагент
	|			И (ВТ_ДанныеДокументов.НазначениеПлатежа ПОДОБНО ДоговорыКредитовИДепозитов.Наименование)";

	Запрос.УстановитьПараметр("ДанныеДокументов", ТаблицаИсходныхДанных);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьДеревоПодобраннымиЗначениями(ДеревоДокументов, Выборка, НСтр("ru = 'Поиск договоров в назначении платежа'"));
	
	ПоместитьВоВременноеХранилище(ДеревоДокументов,АдресХранилища);
	
КонецПроцедуры

Процедура ЗаполнитьПоИсторическимДанным(Параметры,АдресХранилища) Экспорт

	ДанныеДляЗапросаАнализаДанных = ПолучитьСтруктуруДанныхДляЗапросаАнализаДанных(Параметры.ДеревоДокументов, Параметры.ВидДвиженияОтбор);
	
	СоздатьВременнуюТаблицуВходныхДанныхДляАнализаДанных(ДанныеДляЗапросаАнализаДанных);
	
	МассивПакетовЗапроса = ПакетыЗапросаДляАнализаДанных(ДанныеДляЗапросаАнализаДанных);
	        	
	ТекстЗапроса = СтрСоединить(МассивПакетовЗапроса, ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета());
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДанныеДляЗапросаАнализаДанных.МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	РезультатАнализаДанныхТабличныйДокумент = Новый ТабличныйДокумент;
	
	РезультатАнализаДанных = Новый Структура;
	МассивДанныхМоделиПрогноза = Новый Массив;
	ВыводитьРезультатАнализаДанныхВТабличныйДокумент = Ложь;
	Для НомерПакета = 0 По ДанныеДляЗапросаАнализаДанных.КолонкиПрогнозируемые.Количество()-1 Цикл
		
		РезультатАнализа = ВыполнитьАнализДанных(РезультатЗапроса[НомерПакета]);
		
		ДанныеМоделиПрогноза = ИнициализироватьТаблицуДанныхМоделиПрогноза(ДанныеДляЗапросаАнализаДанных.КолонкиВходные);
		                                                           
		ОписаниеПрогнозируемойКолонки = ДанныеДляЗапросаАнализаДанных.КолонкиПрогнозируемые[НомерПакета];
		
		СобратьДанныеМоделиПрогноза(РезультатАнализа.СоздатьМодельПрогноза(),ДанныеМоделиПрогноза,ОписаниеПрогнозируемойКолонки);
		
		ВывестиРезультатАнализаДанныхВТабличныйДокумент(РезультатАнализа,РезультатАнализаДанныхТабличныйДокумент,ВыводитьРезультатАнализаДанныхВТабличныйДокумент);
		
		МассивДанныхМоделиПрогноза.Добавить(Новый Структура("ДанныеМоделиПрогноза,ОписаниеПрогнозируемойКолонки"
															,ДанныеМоделиПрогноза
															,ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ОписаниеПрогнозируемойКолонки)));

	КонецЦикла;

	РезультатАнализаДанных.Вставить("МассивДанныхМоделиПрогноза",МассивДанныхМоделиПрогноза);
	РезультатАнализаДанных.Вставить("РезультатАнализаДанныхТабличныйДокумент",РезультатАнализаДанныхТабличныйДокумент);
	РезультатАнализаДанных.Вставить("ВыводитьРезультатАнализаДанныхВТабличныйДокумент",ВыводитьРезультатАнализаДанныхВТабличныйДокумент);
	ПоместитьВоВременноеХранилище(РезультатАнализаДанных,АдресХранилища);
	
КонецПроцедуры // ЗаполнитьПоИсторическимДаннымНаСервере()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьТаблицуИсходныхДанных(Знач ДеревоДокументов)
	
	ТаблицаИсходныхДанных = Новый ТаблицаЗначений;
	ТаблицаИсходныхДанных.Колонки.Добавить("Ссылка",              ДеревоДокументов.Колонки.Ссылка.ТипЗначения);
	ТаблицаИсходныхДанных.Колонки.Добавить("Организация",         ДеревоДокументов.Колонки.Организация.ТипЗначения);
	ТаблицаИсходныхДанных.Колонки.Добавить("Контрагент",          ДеревоДокументов.Колонки.Контрагент.ТипЗначения);
	ТаблицаИсходныхДанных.Колонки.Добавить("СчетОрганизации",     ДеревоДокументов.Колонки.СчетОрганизации.ТипЗначения);
	ТаблицаИсходныхДанных.Колонки.Добавить("НазначениеПлатежа",   ДеревоДокументов.Колонки.НазначениеПлатежа.ТипЗначения);
	
	Для Каждого ТекСтр Из ДеревоДокументов.Строки Цикл
		
		ЗаполнитьЗначенияСвойств(ТаблицаИсходныхДанных.Добавить(), ТекСтр);
		
	КонецЦикла;
	
	Возврат ТаблицаИсходныхДанных;

КонецФункции

Процедура ВывестиРезультатАнализаДанныхВТабличныйДокумент(РезультатАнализа, 
			ТабличныйДокумент, ВыводитьРезультатАнализаДанныхВТабличныйДокумент)
	
	Если Не ВыводитьРезультатАнализаДанныхВТабличныйДокумент Тогда
		Возврат;	
	КонецЕсли;
	
	Построитель = Новый ПостроительОтчетаАнализаДанных();
	Построитель.Макет = Неопределено;
	Построитель.ТипАнализа = Тип("АнализДанныхДеревоРешений");
	Построитель.Вывести(РезультатАнализа, ТабличныйДокумент);		
	
КонецПроцедуры

Функция ВыполнитьАнализДанных(ИсточникДанных)

	Анализ = Новый АнализДанных;
    Анализ.ТипАнализа = Тип("АнализДанныхДеревоРешений");
	Анализ.ИсточникДанных = ИсточникДанных;
    Анализ.Параметры.ТипУпрощения.Значение = ТипУпрощенияДереваРешений.Упрощать;
	РезультатАнализа = Анализ.Выполнить();
	Возврат  РезультатАнализа;
		
КонецФункции

Процедура СобратьДанныеМоделиПрогноза(МодельПрогноза,ДанныеМоделиПрогноза,ОписаниеПрогнозируемойКолонки)
	
	ДобавитьПрогнозируемуюКолонкуВТаблицу(ДанныеМоделиПрогноза,ОписаниеПрогнозируемойКолонки);
	
	ВыполнитьСборДанныхДереваРешений(МодельПрогноза.КорневыеУзлы,ДанныеМоделиПрогноза,ОписаниеПрогнозируемойКолонки.ИмяКолонки,0,Неопределено);
	
КонецПроцедуры 

Процедура ВыполнитьСборДанныхДереваРешений(Узлы,
										ДанныеМоделиПрогноза,
										ИмяКолонкиРешения,
										УровеньДерева,
										ПредыдущаяСтрокаТаблицы)

	Если Узлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Узел Из Узлы Цикл
		
		УровеньДерева = УровеньДерева + 1;
		
		Если УровеньДерева >=2 Тогда
			СтрокаДанных = ДанныеМоделиПрогноза.Добавить();
			
			Если Не ПредыдущаяСтрокаТаблицы = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СтрокаДанных,ПредыдущаяСтрокаТаблицы,,ИмяКолонкиРешения+",КоличествоСлучаев,Вероятность");
			КонецЕсли;
		Иначе
			СтрокаДанных = Неопределено;
		КонецЕсли;
		
		Если Не СтрокаДанных = Неопределено Тогда
			ДанныеУзла = ДанныеУзлаДереваРешений(Узел,ИмяКолонкиРешения);
			ЗаполнитьЗначенияСвойств(СтрокаДанных,ДанныеУзла);
		КонецЕсли;
		
		ВыполнитьСборДанныхДереваРешений(Узел.Узлы,ДанныеМоделиПрогноза,ИмяКолонкиРешения,УровеньДерева,СтрокаДанных);
		
		УровеньДерева = УровеньДерева - 1;
	КонецЦикла;
	
КонецПроцедуры 

Функция ДанныеУзлаДереваРешений(Узел,ИмяКолонкиРешения)

	ДанныеУзла = Новый Структура;
	ДанныеУзла.Вставить(Узел.Условие[0].Имя,Узел.Условие[0].Значение);
	ДанныеУзла.Вставить("КоличествоСлучаев",Узел.КоличествоСлучаев);
	ДанныеУзла.Вставить("Вероятность",Узел.Решение.Вероятность);
	ДанныеУзла.Вставить(ИмяКолонкиРешения,Узел.Решение.Решение[ИмяКолонкиРешения].Значение);
	
	Возврат ДанныеУзла;
	
КонецФункции 

Процедура ДобавитьПрогнозируемуюКолонкуВТаблицу(ДанныеМоделиПрогноза,ОписаниеПрогнозируемойКолонки)

	ДанныеМоделиПрогноза.Колонки.Добавить(
		ОписаниеПрогнозируемойКолонки.ИмяКолонки,
		ОписаниеПрогнозируемойКолонки.ТипКолонки);

КонецПроцедуры

Функция ИнициализироватьТаблицуДанныхМоделиПрогноза(КолонкиВходные)
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	Для Каждого ОписаниеВходойКолонки Из КолонкиВходные Цикл
		ТаблицаДанных.Колонки.Добавить(ОписаниеВходойКолонки.ИмяКолонки,ОписаниеВходойКолонки.ТипКолонки);
	КонецЦикла;
	
	КвЧисла = Новый КвалификаторыЧисла(15,0);
	
	ТаблицаДанных.Колонки.Добавить("КоличествоСлучаев", Новый ОписаниеТипов("Число",,,КвЧисла));
	ТаблицаДанных.Колонки.Добавить("Вероятность", Новый ОписаниеТипов("Число",,,КвЧисла));
	
	Возврат ТаблицаДанных;

КонецФункции

Функция ПакетыЗапросаДляАнализаДанных(ДанныеДляЗапросаАнализаДанных)

	МассивПакетовЗапроса = Новый Массив;
	
	Для Каждого ОписаниеПрогнозируемойКолонки Из ДанныеДляЗапросаАнализаДанных.КолонкиПрогнозируемые Цикл
		
		Если  ОписаниеПрогнозируемойКолонки.Использование = 1 Тогда	// В шапке и расшифровке

			ТекстЗапросаШапка = ТекстЗапросаПоШапкеДокументаДляАнализаДанных();
			ТекстЗапросРасшифровка = ТекстЗапросаПоРасшифровкеДокументаДляАнализаДанных();
			
			ТекстЗапроса = ТекстЗапросаШапка+"
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|"+ТекстЗапросРасшифровка;
			
		ИначеЕсли ОписаниеПрогнозируемойКолонки.Использование = 2 Тогда // Только в шапке
			ТекстЗапроса = ТекстЗапросаПоШапкеДокументаДляАнализаДанных();
		ИначеЕсли ОписаниеПрогнозируемойКолонки.Использование = 3 Тогда // Только в расшифровке
			ТекстЗапроса = ТекстЗапросаПоРасшифровкеДокументаДляАнализаДанных();
		КонецЕсли;
		
		ПрогнозируемоеПоле = "Документ." + ?(ОписаниеПрогнозируемойКолонки.ИмяРеквизита = "",
					ОписаниеПрогнозируемойКолонки.ИмяКолонки, ОписаниеПрогнозируемойКолонки.ИмяРеквизита); 

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ПрогнозируемоеПолеШапки",ПрогнозируемоеПоле);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ПрогнозируемоеПолеРасшифровки",ПрогнозируемоеПоле);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИмяПрогнозируемогоПоля",ОписаниеПрогнозируемойКолонки.ИмяКолонки);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&УсловиеПоПрогнозируемомуПолюШапка"
												,ТекстУсловияПоПрогнозируемомуПолюДляЗапросаАнализаДанных(ОписаниеПрогнозируемойКолонки.ТипКолонки,ПрогнозируемоеПоле));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&УсловиеПоПрогнозируемомуПолюРасшифровка"
												,ТекстУсловияПоПрогнозируемомуПолюДляЗапросаАнализаДанных(ОписаниеПрогнозируемойКолонки.ТипКолонки,ПрогнозируемоеПоле));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ПоступлениеБезналичныхДенежныхСредств",ДанныеДляЗапросаАнализаДанных.ИмяДокумента);
								
		МассивПакетовЗапроса.Добавить(ТекстЗапроса);
		
	КонецЦикла;
	
	Возврат МассивПакетовЗапроса;

КонецФункции 

Функция ТекстЗапросаПоШапкеДокументаДляАнализаДанных()
			
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Документ.Организация КАК Организация,
		|	Документ.Контрагент КАК Контрагент,
		|	Документ.БанковскийСчет КАК СчетОрганизации,
		|	&ПрогнозируемоеПолеШапки КАК ИмяПрогнозируемогоПоля
		|ИЗ
		|	Документ.ПоступлениеБезналичныхДенежныхСредств КАК Документ
		|ГДЕ
		|	 &УсловиеПоПрогнозируемомуПолюШапка
		|	И Документ.Контрагент В
		|			(ВЫБРАТЬ
		|				ВТ_ТаблицаВходныхДанных.Контрагент
		|			ИЗ
		|				ВТ_ТаблицаВходныхДанных КАК ВТ_ТаблицаВходныхДанных)";
	
	Возврат	ТекстЗапроса;

КонецФункции 

Функция ТекстЗапросаПоРасшифровкеДокументаДляАнализаДанных()
			
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Документ.Ссылка.Организация КАК Организация,
		|	Документ.Ссылка.Контрагент КАК Контрагент,
		|	Документ.Ссылка.БанковскийСчет КАК СчетОрганизации,
		|	&ПрогнозируемоеПолеРасшифровки КАК ИмяПрогнозируемогоПоля
		|ИЗ
		|	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК Документ
		|ГДЕ
		|	&УсловиеПоПрогнозируемомуПолюРасшифровка
		|	И Документ.Ссылка.Контрагент В
		|			(ВЫБРАТЬ
		|				ВТ_ТаблицаВходныхДанных.Контрагент
		|			ИЗ
		|				ВТ_ТаблицаВходныхДанных КАК ВТ_ТаблицаВходныхДанных)";
	
	Возврат	ТекстЗапроса;

КонецФункции 

Процедура СоздатьВременнуюТаблицуВходныхДанныхДляАнализаДанных(ДанныеДляЗапросаАнализаДанных)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДанныеДляЗапросаАнализаДанных.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&ПоляЗапроса
	|ПОМЕСТИТЬ ВТ_ТаблицаВходныхДанных
	|ИЗ
	|	&ТаблицаВходныхДанных КАК ТаблицаВходныхДанных";
	
	ПоляЗапроса = ПоляЗапросаВходныхДанных(ДанныеДляЗапросаАнализаДанных.КолонкиВходные,"ТаблицаВходныхДанных");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ПоляЗапроса",ПоляЗапроса);
	
	Запрос.УстановитьПараметр("ТаблицаВходныхДанных",ДанныеДляЗапросаАнализаДанных.ТаблицаВходныхДанных);
	Запрос.Выполнить();

КонецПроцедуры

Функция ПоляЗапросаВходныхДанных(КолонкиВходные,ИмяТаблицы)

	МассивПолейЗапросаВходныхДанных = СобратьМассивВходныхПолейЗапросаДляАнализаДанных(КолонкиВходные,ИмяТаблицы);
	
	ПоляЗапроса = СтрСоединить(МассивПолейЗапросаВходныхДанных,",");

	Возврат ПоляЗапроса;
	
КонецФункции 

Функция СобратьМассивВходныхПолейЗапросаДляАнализаДанных(КолонкиВходные,ИмяТаблицы,ДобавлятьПсевдоним = Истина)

	МассивПолейЗапросаВходныхДанных = Новый Массив;
	
	Для Каждого ОписаниеВходнойКолонки Из КолонкиВходные Цикл
		
		МассивПолейЗапросаВходныхДанных.Добавить(ИмяТаблицы+"."+ОписаниеВходнойКолонки.ИмяКолонки 
			+?(ДобавлятьПсевдоним," КАК "+ОписаниеВходнойКолонки.ИмяКолонки,""));
		
	КонецЦикла;

	Возврат МассивПолейЗапросаВходныхДанных;
	
КонецФункции

Функция ТекстУсловияПоПрогнозируемомуПолюДляЗапросаАнализаДанных(ОписаниеТипа,ИмяПоля)

	МассивУсловий = Новый Массив;
	ПроверятьНаНеопределено = ОписаниеТипа.Типы().Количество() > 1;
	Для Каждого Тип Из ОписаниеТипа.Типы() Цикл
		
		ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
		
		Если Не ОбъектМетаданных = Неопределено Тогда
			
			ИмяОбъекта = ОбъектМетаданных.Имя;
			ВидОбъекта = ОбщегоНазначения.ВидОбъектаПоТипу(Тип);
			
			Условие = " НЕ Выразить("+ИмяПоля+" КАК "+ВидОбъекта+"."+ИмяОбъекта+") =  Значение("+ВидОбъекта+"."+ИмяОбъекта+".ПустаяСсылка) ";
			МассивУсловий.Добавить(Условие);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивУсловий.Количество() = 0 Тогда
		ТекстУсловия = "ИСТИНА"; 
	ИначеЕсли ПроверятьНаНеопределено Тогда
		Условие = " НЕ " + ИмяПоля + " = Неопределено";
		МассивУсловий.Добавить(Условие);
	КонецЕсли;
	
	ТекстУсловия = СтрСоединить(МассивУсловий, "И");
	
	Возврат ТекстУсловия;
	
КонецФункции	

Функция ИнициализироватьТаблицуОписанияКолонок()

	ОписаниеКолонок = Новый ТаблицаЗначений;
	ОписаниеКолонок.Колонки.Добавить("ИмяКолонки");
	ОписаниеКолонок.Колонки.Добавить("ТипКолонки");
	ОписаниеКолонок.Колонки.Добавить("Использование");
	ОписаниеКолонок.Колонки.Добавить("ТолькоПервыйУровеньДерева");
	ОписаниеКолонок.Колонки.Добавить("ИмяРеквизита");

	Возврат ОписаниеКолонок;
	
КонецФункции 

// Добавляет в таблицу значений строку с заполнением
//
// Параметры:
//  <Таблица>  - <ТаблицаЗначений> - Таблица занчений, в которую добавляется строка
//  <ИмяКолонки>  - <Строка> - Имя добавляемой колонки
//  <ТипКолонки>  - <ОписаниеТипов> - Тип добавляемой колонки
//  <Использование>  - <Число> - 1: используется в шапке и расшифровке 2: только в шапке 3: только в  расшифровке
//
Процедура ДобавитьОписаниеКолонки(Таблица,
								ИмяКолонки,
								ТипКолонки,
								Использование = 1,
								ТолькоПервыйУровеньДерева = Ложь,
								ИмяРеквизита = "")

	НовСтр = Таблица.Добавить();
	НовСтр.ИмяКолонки = ИмяКолонки;
	НовСтр.ТипКолонки = ТипКолонки;
	НовСтр.Использование = Использование;
	НовСтр.ТолькоПервыйУровеньДерева = ТолькоПервыйУровеньДерева;
	НовСтр.ИмяРеквизита = ИмяРеквизита;

КонецПроцедуры

Функция ПолучитьСтруктуруДанныхДляЗапросаАнализаДанных(Знач ДеревоДокументов,ВидДвиженияОтбор)
	
	КолонкиВходные = ИнициализироватьТаблицуОписанияКолонок();
	ДобавитьОписаниеКолонки(КолонкиВходные,"Организация",ДеревоДокументов.Колонки.Организация.ТипЗначения,2,Истина);
	ДобавитьОписаниеКолонки(КолонкиВходные,"Контрагент", ДеревоДокументов.Колонки.Контрагент.ТипЗначения,2,Истина);
	ДобавитьОписаниеКолонки(КолонкиВходные,"СчетОрганизации",ДеревоДокументов.Колонки.СчетОрганизации.ТипЗначения,2,Истина);
	
	КолонкиПрогнозируемые = ИнициализироватьТаблицуОписанияКолонок();
	ТипыДоговоры = Новый Массив;
    ТипыДоговоры.Добавить(Тип("СправочникСсылка.ДоговорыКонтрагентов"));
	ТипыДоговоры.Добавить(Тип("СправочникСсылка.ДоговорыМеждуОрганизациями"));
	ДобавитьОписаниеКолонки(КолонкиПрогнозируемые, "ДоговорКонтрагента", 
								Новый ОписаниеТипов(ТипыДоговоры), 2 , , "Договор");
		
	ДобавитьОписаниеКолонки(КолонкиПрогнозируемые,"СтатьяДвиженияДенежныхСредств",  
		ДеревоДокументов.Колонки.СтатьяДвиженияДенежныхСредств.ТипЗначения,3);
	ДобавитьОписаниеКолонки(КолонкиПрогнозируемые,"ЦФО",		ДеревоДокументов.Колонки.ЦФО.ТипЗначения,3);
	ДобавитьОписаниеКолонки(КолонкиПрогнозируемые,"Проект",		ДеревоДокументов.Колонки.Проект.ТипЗначения,3);
	ДобавитьОписаниеКолонки(КолонкиПрогнозируемые,"Аналитика1",	ДеревоДокументов.Колонки.АналитикаБДДС1.ТипЗначения,3);
	ДобавитьОписаниеКолонки(КолонкиПрогнозируемые,"Аналитика2",	ДеревоДокументов.Колонки.АналитикаБДДС2.ТипЗначения,3);
	ДобавитьОписаниеКолонки(КолонкиПрогнозируемые,"Аналитика3",	ДеревоДокументов.Колонки.АналитикаБДДС3.ТипЗначения,3);
	ДобавитьОписаниеКолонки(КолонкиПрогнозируемые,"Аналитика4",	ДеревоДокументов.Колонки.АналитикаБДДС4.ТипЗначения,3);
	ДобавитьОписаниеКолонки(КолонкиПрогнозируемые,"Аналитика5",	ДеревоДокументов.Колонки.АналитикаБДДС5.ТипЗначения,3);
	ДобавитьОписаниеКолонки(КолонкиПрогнозируемые,"Аналитика6",	ДеревоДокументов.Колонки.АналитикаБДДС6.ТипЗначения,3);
	
	ИмяДокумента = ?(ВидДвиженияОтбор = Перечисления.ВидыДвиженийПриходРасход.Приход,
		НСтр("ru = 'ПоступлениеБезналичныхДенежныхСредств'"),НСтр("ru = 'СписаниеБезналичныхДенежныхСредств'"));
	
	ТаблицаВходныхДанных = Новый ТаблицаЗначений;
	
	Для Каждого ОписаниеВходнойКолонки Из КолонкиВходные Цикл		
		ТаблицаВходныхДанных.Колонки.Добавить(ОписаниеВходнойКолонки.ИмяКолонки, ОписаниеВходнойКолонки.ТипКолонки);		
	КонецЦикла;
	
	Для Каждого ТекСтр Из ДеревоДокументов.Строки Цикл		
		ЗаполнитьЗначенияСвойств(ТаблицаВходныхДанных.Добавить(), ТекСтр);		
	КонецЦикла;
		
	ТаблицаВходныхДанных.Свернуть(ИменаКолонокТаблицы(ТаблицаВходныхДанных));
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("КолонкиВходные", КолонкиВходные);
	СтруктураДанных.Вставить("КолонкиПрогнозируемые", КолонкиПрогнозируемые);
	СтруктураДанных.Вставить("ИмяДокумента", ИмяДокумента);
	СтруктураДанных.Вставить("ТаблицаВходныхДанных", ТаблицаВходныхДанных);
	СтруктураДанных.Вставить("МенеджерВременныхТаблиц", МенеджерВременныхТаблиц);
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция ИменаКолонокТаблицы(Таблица)
	
	МассивИменКолонок = Новый Массив;
	Для Каждого Колонка Из Таблица.Колонки Цикл
		МассивИменКолонок.Добавить(Колонка.Имя);	
	КонецЦикла;
	
	Возврат СтрСоединить(МассивИменКолонок, ",");

КонецФункции

Процедура ЗаполнитьДеревоПодобраннымиЗначениями(Знач ДеревоДокументов, Знач Выборка, ИмяИнструмента)
	
	// Получим массив реквизитов из шаблона
	МассивРеквизитов = Новый Массив;
	Для Каждого ТекРеквизит Из Метаданные.РегистрыСведений.ШаблоныАналитикПлатежей.Ресурсы Цикл
		
		МассивРеквизитов.Добавить(ТекРеквизит.Имя);
		
	КонецЦикла;
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаДокумента = ДеревоДокументов.Строки.Найти(Выборка.Ссылка, "Ссылка");
		Если СтрокаДокумента = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьНезаполненныеЗначенияСтроки(СтрокаДокумента, Выборка, МассивРеквизитов, ИмяИнструмента);
		
		Для Каждого СтрокаРасшифровкиДокумента Из СтрокаДокумента.Строки Цикл
			ЗаполнитьНезаполненныеЗначенияСтроки(СтрокаРасшифровкиДокумента, Выборка, МассивРеквизитов, ИмяИнструмента);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьНезаполненныеЗначенияСтроки(Приемник, Источник, МассивРеквизитов, ИмяИнструмента)
	
	ЕстьИзменениеВСтроке = Ложь;
	Для Каждого ТекИмяРеквизита Из МассивРеквизитов Цикл
		
		Если ЗначениеЗаполнено(Источник[ТекИмяРеквизита]) Тогда
			Приемник[ТекИмяРеквизита] = Источник[ТекИмяРеквизита];
			ЕстьИзменениеВСтроке = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьИзменениеВСтроке Тогда
		Приемник.РезультатЗаполненияАналитик = Приемник.РезультатЗаполненияАналитик + ИмяИнструмента + ";"; 	
	КонецЕсли;
	
	Приемник.ДанныеИзменены = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
